---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.GetExactLength
source: html/67e54cf8-f9ba-fb2c-5519-6b54bdb1c51d.htm
---
# Autodesk.Revit.DB.CurveLoop.GetExactLength Method

Returns the sum of exact lengths of all curves in the loop.

## Syntax (C#)
```csharp
public double GetExactLength()
```

## Returns
The total length of the curves in the loop.